public class Lesson_2 {

    public static void main(String[] args) {
        /* Необходимо создать целочисленные переменные a и b, присвоить
         произвольные значения переменным на ваш выбор и вывести результаты с
         ледующих операций с этими переменными: сложение, умножение, вычитание,
          деление и остаток от деления. Также сделать проверку на четность этих
           переменных и вывести результат.
         */

     /*   int a = 5;
        int b = 2;
        System.out.println(a+b);
        System.out.println(a-b);
        System.out.println(a*b);
        System.out.println(a/b);
        System.out.println(a%b);
        //Также сделать проверку на четность этих
        // переменных и вывести результат.
        System.out.println(a%2);
        System.out.println(b%2);
        /*Создать программу дележа добычи на пиратском корабле. По обычаю,
        половина добычи идет владельцу корабля, половина оставшегося — капитану,
         остальное делится поровну между всеми членами команды, включая капитана.
         азмер добычи (например, в пиастрах) и количество пиратов на корабле задать
          переменными.

      Вывести на экран кому сколько пиастров полагается
       Сколько получит капитан (Джек Воробей, естественно), если он утверждает,
       что корабль принадлежит ему?*/

       /* int teamPirot = 45;
        int loot =  1745;
        //--------- -----
        int leftover = loot ;
        int ownerShare = leftover / 2;
        leftover = leftover - ownerShare;
        int captanShare = leftover / 2;
        leftover = leftover-captanShare;
        int teamShare = leftover / (teamPirot+1);
        captanShare = captanShare + teamShare;
        leftover = leftover - teamShare * (teamPirot+1);
        System.out.println(ownerShare);
        System.out.println(captanShare);
        System.out.println(teamShare);
        System.out.println(leftover);
*/
    }
}