import java.util.Locale;

public class Lesson_5_string {
    public static void main(String[] args) {

//        String s = "Перестановочный алгоритм быстрого действия";
//        {
//          //  System.out.println(s.charAt(6));
//         //   System.out.println(s.length());
//            //   Задача №1
////        Дана строка:
////        String s = “Перестановочный алгоритм быстрого действия”;
////        необходимо вывести все буквы “о” из этой строки.
////                Для указанной строки ответ будет “ооооо” (или в столбик)
//
//
//            for (int i = 0; i < s.length(); i++) {
//              // System.out.println(s.charAt(i));
//                if (s.charAt(i) =='о'){
//                    System.out.println('i');
//
//                }
//            }
//
//
//        }
        //
//        Задача №2
//        Дана строка:
//        String s = “Перевыборы выбранного президента”;
//        необходимо подсчитать количество букв “е” в строке.
//        Для указанной строки ответ будет 4.
//        String s = "Перевыборы выбранного президента";
//        int count = 0;
//        for (int i = 0; i < s.length(); i++) {
//            if (s.charAt(i) =='е'){
//                count ++;
//            }
//        }
//        System.out.println(count);
        //        Экстра задача №1
//        Дана строка:
//        String s = “Посмотрите как Рите нравится ритм”;
//        необходимо вывести индексы начала всех подстрок - “рит”, независимо от регистра.
//                Для указанной строки ответ будет 6, 15, 29.
//        String s ="Посмотрите как Рите нравится ритм";
//        s=s.toLowerCase();
//        String substr = "рит";
//        for (int i = 0; i < substr.length(); i++){
//          if (substr.equals(s.substring(i,i + substr.length()))){
//              System.out.println();
//          }
//        }
//        int index = s.indexOf(substr);
//        while (index != -1){
//            System.out.println(index);
//            index = s.indexOf(substr,index + 1);
//
//        }
//

    }
}




//

//
//        Экстра задача №2
//        Дан массив:
//        String[][] array = {{“Привет”, “всем”, “кто”}, {“изучает”, “язык”, “программирования”}, {“java”}};
//        необходимо подсчитать количество строк в массиве, которые не содержат буквы “е”.
//        Вывести следующие строки с соответствующим форматированием (как пирамиды):
//




